ArduCAM/Energia/tools/common/DSLite/common/targetdb/Modules/MSP432/coredebug.xml
<module id="COREDEBUG" HW_revision=""><register id="DHCSR" width="32" offset="0xDF0" internal="0" description="Debug Halting Control and Status Register"><bitfield id="C_DEBUGEN" description="Enables debug" begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="C_HALT" description="Halts the core" begin="1" end="1" width="1" rwaccess="R/W"/><bitfield id="C_STEP" description="Steps the core in halted debug" begin="2" end="2" width="1" rwaccess="R/W"/><bitfield id="C_MASKINTS" description="Mask interrupts when stepping or running in halted debug" begin="3" end="3" width="1" rwaccess="R/W"/><bitfield id="C_SNAPSTALL" description="If the core is stalled on a load/store operation the stall ceas" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="S_REGRDY" description="Register Read/Write on the Debug Core Register Selector registe" begin="16" end="16" width="1" rwaccess="R/W"/><bitfield id="S_HALT" description="The core is in debug state when S_HALT is set." begin="17" end="17" width="1" rwaccess="R/W"/><bitfield id="S_SLEEP" description="Indicates that the core is sleeping (WFI, WFE, or SLEEP-ON-EXIT" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="S_LOCKUP" description="Reads as one if the core is running (not halted) and a lockup c" begin="19" end="19" width="1" rwaccess="R/W"/><bitfield id="S_RETIRE_ST" description="Indicates that an instruction has completed since last read" begin="24" end="24" width="1" rwaccess="R/W"/><bitfield id="S_RESET_ST" description="Indicates that the core has been reset, or is now being reset, " begin="25" end="25" width="1" rwaccess="R/W"/></register><register id="DCRSR" width="32" offset="0xDF4" internal="0" description="Deubg Core Register Selector Register"><bitfield id="REGSEL" description="Register select" begin="4" end="0" width="5" rwaccess="R/W"><bitenum id="REGSEL__0" value="0x00" description="R0"/><bitenum id="REGSEL__0" value="0x0" description="R11"/><bitenum id="REGSEL__1" value="0x01" description="R1"/><bitenum id="REGSEL__2" value="0x02" description="R2"/><bitenum id="REGSEL__3" value="0x03" description="R3"/><bitenum id="REGSEL__4" value="0x04" description="R4"/><bitenum id="REGSEL__5" value="0x05" description="R5"/><bitenum id="REGSEL__6" value="0x06" description="R6"/><bitenum id="REGSEL__7" value="0x07" description="R7"/><bitenum id="REGSEL__8" value="0x08" description="R8"/><bitenum id="REGSEL__9" value="0x09" description="R9"/><bitenum id="REGSEL__10" value="0x0A" description="R10"/><bitenum id="REGSEL__12" value="0x0C" description="R12"/><bitenum id="REGSEL__13" value="0x0D" description="Current SP"/><bitenum id="REGSEL__14" value="0x0E" description="LR"/><bitenum id="REGSEL__15" value="0x0F" description="DebugReturnAddress"/><bitenum id="REGSEL__16" value="0x10" description="xPSR/flags, execution state information, and exception number"/><bitenum id="REGSEL__17" value="0x11" description="MSP (Main SP)"/><bitenum id="REGSEL__18" value="0x12" description="PSP (Process SP)"/><bitenum id="REGSEL__20" value="0x14" description="CONTROL bits [31:24], FAULTMASK bits [23:16], BASEPRI bits [15:"/></bitfield><bitfield id="REGWNR" description="Write = 1, Read = 0" begin="16" end="16" width="1" rwaccess="R/W"/></register><register id="DCRDR" width="32" offset="0xDF8" internal="0" description="Debug Core Register Data Register"/><register id="DEMCR" width="32" offset="0xDFC" internal="0" description="Debug Exception and Monitor Control Register"><bitfield id="VC_CORERESET" description="Reset Vector Catch. Halt running system if Core reset occurs." begin="0" end="0" width="1" rwaccess="R/W"/><bitfield id="VC_MMERR" description="Debug trap on Memory Management faults." begin="4" end="4" width="1" rwaccess="R/W"/><bitfield id="VC_NOCPERR" description="Debug trap on Usage Fault access to Coprocessor that is not pre" begin="5" end="5" width="1" rwaccess="R/W"/><bitfield id="VC_CHKERR" description="Debug trap on Usage Fault enabled checking errors." begin="6" end="6" width="1" rwaccess="R/W"/><bitfield id="VC_STATERR" description="Debug trap on Usage Fault state errors." begin="7" end="7" width="1" rwaccess="R/W"/><bitfield id="VC_BUSERR" description="Debug Trap on normal Bus error." begin="8" end="8" width="1" rwaccess="R/W"/><bitfield id="VC_INTERR" description="Debug Trap on interrupt/exception service errors" begin="9" end="9" width="1" rwaccess="R/W"/><bitfield id="VC_HARDERR" description="Debug trap on Hard Fault." begin="10" end="10" width="1" rwaccess="R/W"/><bitfield id="MON_EN" description="Enable the debug monitor" begin="16" end="16" width="1" rwaccess="R/W"/><bitfield id="MON_PEND" description="Pend the monitor to activate when priority permits" begin="17" end="17" width="1" rwaccess="R/W"/><bitfield id="MON_STEP" description="When MON_EN = 1, this steps the core" begin="18" end="18" width="1" rwaccess="R/W"/><bitfield id="MON_REQ" description="This enables the monitor to identify how it wakes up" begin="19" end="19" width="1" rwaccess="R/W"><bitenum id="MON_REQ__0" value="0x0" description="woken up by debug exception."/><bitenum id="MON_REQ__1" value="0x1" description="woken up by MON_PEND"/></bitfield><bitfield id="TRCENA" description="This bit must be set to 1 to enable use of the trace and debug " begin="24" end="24" width="1" rwaccess="R/W"/></register></module>